In [19]:
import pandas as pd

# 예제 1-8 결측값으로 인스턴스 생성

In [20]:
import numpy as np

In [21]:
df_na = pd.DataFrame([1,2,np.nan])

In [22]:
df_na

     0
0  1.0
1  2.0
2  NaN

In [23]:
df_na.sum()

0    3.0
dtype: float64

In [24]:
# skipna는 기본값이 True이며 False로 명시적으로 주어졌을 경우 NaN을 포함하여 연산을 한다.
# 이때 모든 NaN 값의 연산은 NaN으로 표기함

In [25]:
df_na.sum(skipna = False)

0   NaN
dtype: float64

In [26]:
df_na < 3

       0
0   True
1   True
2  False

In [27]:
df_na < 2

       0
0   True
1  False
2  False

In [28]:
df_na < np.nan

       0
0  False
1  False
2  False

In [29]:
df_na > np.nan

       0
0  False
1  False
2  False

In [30]:
# 비교연산은 결측값(누락값)에서 사용할 수 없다.

In [31]:
df_na == np.nan

       0
0  False
1  False
2  False